In [1]:
import pandas as pd
import numpy as np

In [2]:
#리스트를 생성하기
list1 = ['홍','김','이','박','최']
list2 = ['길동','철수','성계','지성','용수']
list3 = [23,45,99,41,48]

names_dic = {'family_name':list1, 'first_name':list2, 'age':list3}

names = pd.DataFrame(names_dic)
names

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48

In [3]:
list(zip(list1,list2,list3))

[('홍', '길동', 23),
 ('김', '철수', 45),
 ('이', '성계', 99),
 ('박', '지성', 41),
 ('최', '용수', 48)]

In [4]:
#혹은 이 방법도 가능합니다.

pd.DataFrame(list(zip(list1,list2,list3)),
            columns=['familyName','firstName','age'])

  familyName firstName  age
0          홍        길동   23
1          김        철수   45
2          이        성계   99
3          박        지성   41
4          최        용수   48

In [5]:
list4 = np.arange(0,4)
list4

array([0, 1, 2, 3])

In [6]:
list(zip(list1,list2,list4))

[('홍', '길동', 0), ('김', '철수', 1), ('이', '성계', 2), ('박', '지성', 3)]

In [7]:
#주의!! 길이가 다르면 결과도 다르게 나옵니다!!

list4 = np.arange(0,4) #list4 = [0,1,2,3]
pd.DataFrame(list(zip(list1,list2,list4)),
            columns=['familyName','firstName','age'])

  familyName firstName  age
0          홍        길동    0
1          김        철수    1
2          이        성계    2
3          박        지성    3

In [8]:
#자동으로 생성되는 index 확인
names.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
names_dic = {'family_name' : list1, 'first_name':list2, 'age':list3}

names = pd.DataFrame(names_dic,
                     index=['1번학생','2번학생','3번학생','4번학생','5번학생',])

names

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

In [10]:
names = pd.DataFrame(names_dic,
                     index=['1번학생','2번학생','3번학생','4번학생','5번학생',]
                     columns=['age','first_name','family_name'])
names

SyntaxError: invalid syntax (Temp/ipykernel_18320/1865750483.py, line 3)

In [ ]:
names = pd.DataFrame(names_dic)
names.to_csv('names.csv')
new_names = pd.read_csv('names.csv')

In [ ]:
new_names

In [ ]:
#new_names.drop(columns=new_names.columns[0])
#new_names.iloc[:,1:]
new_names

In [ ]:
diamonds = pd.read_csv('./data/data/diamonds.csv', nrows = 1000)
diamonds.info()

In [ ]:
np.finfo('float64')

In [ ]:
np.finfo('float32')

In [ ]:
np.finfo('float16')

In [ ]:
diamonds.head()

In [ ]:
diamonds.describe().T

In [ ]:
np.iinfo('int64')

In [ ]:
#price는 아래와 같이 바꾸면 됨
np.iinfo('int16')

In [ ]:
np.iinfo('int32')

In [ ]:
np.iinfo('int8')

In [ ]:
diamonds2 = pd.read_csv('./data/data/diamonds.csv', nrows = 1000,
                       dtype={
                           'carat':np.float16,
                           'depth':np.float16,
                           'table':np.float16,
                           'x':np.float16,
                           'y':np.float16,
                           'z':np.float16,
                           'price':np.float16})
diamonds2.info()

In [ ]:
round(37.2/78.2,2)

In [ ]:
diamonds2.describe(include='O')

In [ ]:
diamonds2.cut.value_counts()

In [ ]:
diamonds2.color.value_counts()

In [ ]:
diamonds2.clarity.value_counts()

In [ ]:
diamonds3 = pd.read_csv('./data/data/diamonds.csv', nrows = 1000,
                       dtype={
                           'carat':np.float16,
                           'depth':np.float16,
                           'table':np.float16,
                           'x':np.float16,
                           'y':np.float16,
                           'z':np.float16,
                           'price':np.float16,
                           'color':'category',
                           'cut':'category',
                           'clarity':'category', 
                       })
diamonds3.info()

In [ ]:
round(17.6/78.2,2)

In [ ]:
# 특정컬럼만 뽑아서 정렬 - 1) usecols 사용하는 방법
cols = ['carat','color','clarity','depth','table','price']

diamonds4 = pd.read_csv('./data/data/diamonds.csv', nrows = 1000,
                       dtype={
                           'carat':np.float16,
                           'depth':np.float16,
                           'table':np.float16,
                           'price':np.float16,
                           'color':'category',
                           'cut':'category',
                           'clarity':'category', 
                       },
                       usecols=cols)
diamonds4.info()

In [ ]:
#-2) chunksize 로 하는방법
cols = ['carat','color','clarity','depth','table','price']

diamonds_iter = pd.read_csv('./data/data/diamonds.csv', nrows = 1000,
                       dtype={
                           'carat':np.float16,
                           'depth':np.float16,
                           'table':np.float16,
                           'price':np.float16,
                           'color':'category',
                           'cut':'category',
                           'clarity':'category', 
                       },
                       usecols=cols,
                       chunksize=200 #이부분이죠!
                           )

def process(df):
    return f'processed{df.shape} shape of df{df.iloc[0,:]}'

for chunk in diamonds_iter:
    print(process(chunk))

In [ ]:
 diamonds.to_excel('dia.xlsx',sheet_name='test')

In [ ]:
xl_writer = pd.ExcelWriter('dial.xlsx')
diamonds.to_excel(xl_writer, sheet_name='test')
diamonds[diamonds.price > 1000].to_excel(xl_writer, sheet_name='300')
xl_writer.save()

In [ ]:
dia = pd.read_excel('dia.xlsx')
dia

In [ ]:
names_dic

In [ ]:
import json

#encoded = json.dumps(names_dic)
#데이터에는 문제가 없지만. 깨져서 나오는 게 보기 싫을 땐 아래와 같이 해줍니다.
encoded = json.dumps(names_dic,ensure_ascii=False)
encoded

In [11]:
#records는 행의 리스트로 표현합니다.

json_records = names.to_json(orient='records', force_ascii = False)
json_records

'[{"family_name":"홍","first_name":"길동","age":23},{"family_name":"김","first_name":"철수","age":45},{"family_name":"이","first_name":"성계","age":99},{"family_name":"박","first_name":"지성","age":41},{"family_name":"최","first_name":"용수","age":48}]'

In [12]:
pd.read_json(json_records)

  family_name first_name  age
0           홍         길동   23
1           김         철수   45
2           이         성계   99
3           박         지성   41
4           최         용수   48

In [13]:
#split은 columns,index,data 를 따로따로 저장합니다
json_split = names.to_json(orient='split',force_ascii=False)
json_split

'{"columns":["family_name","first_name","age"],"index":["1번학생","2번학생","3번학생","4번학생","5번학생"],"data":[["홍","길동",23],["김","철수",45],["이","성계",99],["박","지성",41],["최","용수",48]]}'

In [14]:
pd.read_json(json_split,orient='split')

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

In [15]:
#index는 index 값을 행에 매핑합니다.
json_index = names.to_json(orient='index',force_ascii=False)
json_index

'{"1번학생":{"family_name":"홍","first_name":"길동","age":23},"2번학생":{"family_name":"김","first_name":"철수","age":45},"3번학생":{"family_name":"이","first_name":"성계","age":99},"4번학생":{"family_name":"박","first_name":"지성","age":41},"5번학생":{"family_name":"최","first_name":"용수","age":48}}'

In [16]:
pd.read_json(json_index, orient='index')

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

In [17]:
json_values= names.to_json(orient='values',force_ascii=False)
json_values

'[["홍","길동",23],["김","철수",45],["이","성계",99],["박","지성",41],["최","용수",48]]'

In [18]:
pd.read_json(json_index, orient='index')

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

In [19]:
#table 은 스키마와 데이터를 나눠서 저장합니다.
json_table= names.to_json(orient='table',force_ascii=False)
json_table

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"family_name","type":"string"},{"name":"first_name","type":"string"},{"name":"age","type":"integer"}],"primaryKey":["index"],"pandas_version":"0.20.0"},"data":[{"index":"1번학생","family_name":"홍","first_name":"길동","age":23},{"index":"2번학생","family_name":"김","first_name":"철수","age":45},{"index":"3번학생","family_name":"이","first_name":"성계","age":99},{"index":"4번학생","family_name":"박","first_name":"지성","age":41},{"index":"5번학생","family_name":"최","first_name":"용수","age":48}]}'

In [20]:
pd.read_json(json_table, orient='table')

     family_name first_name  age
1번학생           홍         길동   23
2번학생           김         철수   45
3번학생           이         성계   99
4번학생           박         지성   41
5번학생           최         용수   48

In [21]:
url = 'https://ko.wikipedia.org/wiki/2015%EB%85%84_%EB%8C%80%ED%95%9C%EB%AF%BC%EA%B5%AD_%EC%A4%91%EB%8F%99%ED%98%B8%ED%9D%A1%EA%B8%B0%EC%A6%9D%ED%9B%84%EA%B5%B0_%EC%9C%A0%ED%96%89'
dfs = pd.read_html(url)
len(dfs)

12

In [22]:
dfs[1]

              날짜           감염자           사망자
0         5월 20일         1명[8]           NaN
1         5월 21일         3명[9]           NaN
2         5월 26일        4명[10]           NaN
3         5월 27일        5명[11]           NaN
4         5월 28일        7명[12]           NaN
..           ...           ...           ...
56        7월 19일          186명           36명
57       10월 25일          186명           37명
58       11월 25일          186명           38명
59  총 감염자 : 186명  총 감염자 : 186명  총 감염자 : 186명
60   총 사망자 : 38명   총 사망자 : 38명   총 사망자 : 38명

[61 rows x 3 columns]

In [24]:
dfs[1][0:10]

       날짜      감염자                    사망자
0  5월 20일    1명[8]                    NaN
1  5월 21일    3명[9]                    NaN
2  5월 26일   4명[10]                    NaN
3  5월 27일   5명[11]                    NaN
4  5월 28일   7명[12]                    NaN
5  5월 29일  12명[13]                    NaN
6  5월 30일  13명[14]                    NaN
7  5월 31일  15명[15]                    NaN
8   6월 1일  18명[16]  1명(사망 후 확진 판정)[5][17]
9   6월 2일  25명[18]                 2명[18]

In [27]:
dfs = pd.read_html(url,na_values='-')
dfs[1][0:10]

       날짜      감염자                    사망자
0  5월 20일    1명[8]                    NaN
1  5월 21일    3명[9]                    NaN
2  5월 26일   4명[10]                    NaN
3  5월 27일   5명[11]                    NaN
4  5월 28일   7명[12]                    NaN
5  5월 29일  12명[13]                    NaN
6  5월 30일  13명[14]                    NaN
7  5월 31일  15명[15]                    NaN
8   6월 1일  18명[16]  1명(사망 후 확진 판정)[5][17]
9   6월 2일  25명[18]                 2명[18]